import { createSlice } from "@reduxjs/toolkit";

export interface securityResearcher {
    id?: number,
    image: string,
    name: string,
    rate: number,
    description: string,
}

const initialState = [
    { id: 0, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 1, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 2, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 3, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 4, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 5, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 6, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
    { id: 7, image: '/Me.jpg', name: 'أنس عتوم', rate: 4.6, description: 'خبرة تزيد عن ثلاث سنوات في مجال الأمن السيبراني وحل الثغرات الأمنية. ماجستير في الذكاء الصنعي وتحليل البيانات حائز على عدة جوائز في مجال إكتشاف الثغرات ' },
]

export const securityResearcherSlice = createSlice({
    name: 'securityResearcher',
    initialState: initialState,
    reducers: {

    }
})

export default securityResearcherSlice.reducer